In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/016.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

,0,1,2,3,4,5
0,NaN,NaN,NaN,"Wise (R) 1,122,173","Randolph (D) 823,681","Cherry (Lib) 95,247"
1,NaN,NaN,NaN,55.0%,40.4%,4.7%
2,County,PR,TP,NaN,NaN,NaN
3,APPLING,19,19,2443,1318,97
4,ATKINSON,6,6,812,525,49

In [5]:
df = df[3:]

In [6]:
df.head(5)

          0   1   2     3     4    5
3   APPLING  19  19  2443  1318   97
4  ATKINSON   6   6   812   525   49
5     BACON   7   7  1295   740   68
6     BAKER   7   7   384   487   29
7   BALDWIN  16  16  4719  4603  332

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

          0     3     4    5
3   APPLING  2443  1318   97
4  ATKINSON   812   525   49
5     BACON  1295   740   68
6     BAKER   384   487   29
7   BALDWIN  4719  4603  332

In [9]:
df.columns = ['county', 'Stan Wise', 'Dawn Randolph', 'Kevin Cherry']

In [10]:
df.tail(5)

        county Stan Wise Dawn Randolph Kevin Cherry
157  WHITFIELD     10782          4662          542
158     WILCOX      1141           719           31
159     WILKES      1394          1108           92
160  WILKINSON      1262          1360           67
161      WORTH      3075          1623          125

In [11]:
df = df.melt(id_vars=['county'])

In [12]:
df.columns = ['county', 'candidate', 'votes']

In [13]:
df.head()

     county  candidate votes
0   APPLING  Stan Wise  2443
1  ATKINSON  Stan Wise   812
2     BACON  Stan Wise  1295
3     BAKER  Stan Wise   384
4   BALDWIN  Stan Wise  4719

In [14]:
df['votes'] = df['votes'].astype(int)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 477 entries, 0 to 476
Data columns (total 3 columns):
county       477 non-null object
candidate    477 non-null object
votes        477 non-null int64
dtypes: int64(1), object(2)
memory usage: 11.3+ KB

In [16]:
df['office'] = 'Public Service Commission'

In [17]:
df['district'] = '5'

In [18]:
df['party'] = ''

In [19]:
df.loc[df['candidate'] == 'Stan Wise', 'party'] = 'Republican'
df.loc[df['candidate'] == 'Dawn Randolph', 'party'] = 'Democrat'
df.loc[df['candidate'] == 'Kevin Cherry', 'party'] = 'Libertarian'

In [20]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate      party
Dawn Randolph  Democrat        823681
Kevin Cherry   Libertarian      95247
Stan Wise      Republican     1122173
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

     county                     office district       party  candidate  votes
0   APPLING  Public Service Commission        5  Republican  Stan Wise   2443
1  ATKINSON  Public Service Commission        5  Republican  Stan Wise    812
2     BACON  Public Service Commission        5  Republican  Stan Wise   1295
3     BAKER  Public Service Commission        5  Republican  Stan Wise    384
4   BALDWIN  Public Service Commission        5  Republican  Stan Wise   4719

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')